In [2]:
import numpy as np
import pandas as pd

In [2]:
dict = {
    "name":["aman","rohan","harryy","raj"],
    "marks":[92,34,24,17],
    "city":["hisua","bareily","nawada","london"]}
print(dict)

{'name': ['aman', 'rohan', 'harryy', 'raj'], 'marks': [92, 34, 24, 17], 'city': ['hisua', 'bareily', 'nawada', 'london']}

In [3]:
df =pd.DataFrame(dict)

In [4]:
df

     name  marks     city
0    aman     92    hisua
1   rohan     34  bareily
2  harryy     24   nawada
3     raj     17   london

In [5]:
df.to_csv('friend.csv')

In [6]:
df.shape

(4, 3)

In [7]:
df.iloc

In [8]:
df.to_csv('friend1.csv', index = False)

In [9]:
df.head(1)

   name  marks   city
0  aman     92  hisua

In [10]:
df.tail(2)

     name  marks    city
2  harryy     24  nawada
3     raj     17  london

In [ ]:
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [12]:
harry = pd.read_csv("C:/Users/amanp/OneDrive/Documents/jj.csv")

In [13]:
harry['Amount'][3]= 3453

C:\Users\amanp\AppData\Local\Temp\ipykernel_92612\2420985761.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  harry['Amount'][3]= 3453
C:\Users\amanp\AppData\Local\Temp\ipykernel_92612\2420985761.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  harry['Amount'][3]= 3453

In [14]:
harry.to_csv("harry.csv")

In [15]:
harry.index = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50]

In [16]:
pan1 = pd.read_excel("C:/Users/amanp/Downloads/Aman_Grocery_Transactions.xlsx")

In [15]:
SER = pd.Series(np.random.rand(20 ) , index = np.arange(20))
SER.head()

0    0.653012
1    0.091002
2    0.481083
3    0.808646
4    0.666524
dtype: float64

In [11]:
df1= pd.DataFrame(np.random.rand(10,4), index = np.arange(10))
df1

          0         1         2         3
0  0.398428  0.842675  0.491726  0.368581
1  0.226257  0.682270  0.920819  0.887805
2  0.532472  0.065927  0.121960  0.478193
3  0.940064  0.507710  0.846506  0.809397
4  0.859183  0.861825  0.084745  0.495624
5  0.061871  0.228202  0.875982  0.704895
6  0.114308  0.812742  0.207250  0.142398
7  0.829447  0.245147  0.378683  0.520431
8  0.988607  0.197249  0.599116  0.443168
9  0.203447  0.022771  0.138566  0.499878

In [19]:
type(df1)

pandas.core.frame.DataFrame

In [20]:
df1.describe

<bound method NDFrame.describe of           0         1         2         3
0  0.608428  0.942188  0.453771  0.987583
1  0.575217  0.102660  0.239723  0.677257
2  0.570574  0.582973  0.911643  0.866714
3  0.875290  0.709307  0.726065  0.590644
4  0.799680  0.416390  0.776483  0.708007
5  0.522116  0.511947  0.435796  0.334733
6  0.117037  0.848875  0.146866  0.175809
7  0.737322  0.472319  0.646639  0.480763
8  0.004160  0.174511  0.503709  0.460213
9  0.030499  0.857187  0.234421  0.411234>

In [21]:
df1[0][0] = 234

C:\Users\amanp\AppData\Local\Temp\ipykernel_92612\3738566526.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df1[0][0] = 234

In [22]:
df1.index

Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int32')

In [23]:
df1.columns

RangeIndex(start=0, stop=4, step=1)

In [24]:
df1.to_numpy()

array([[2.34000000e+02, 9.42187935e-01, 4.53770609e-01, 9.87582779e-01],
       [5.75216820e-01, 1.02660118e-01, 2.39722533e-01, 6.77257335e-01],
       [5.70574105e-01, 5.82972945e-01, 9.11642570e-01, 8.66714472e-01],
       [8.75289597e-01, 7.09306950e-01, 7.26065488e-01, 5.90643857e-01],
       [7.99679938e-01, 4.16389712e-01, 7.76482848e-01, 7.08006759e-01],
       [5.22116393e-01, 5.11946533e-01, 4.35796441e-01, 3.34732718e-01],
       [1.17036957e-01, 8.48874870e-01, 1.46866359e-01, 1.75809118e-01],
       [7.37322407e-01, 4.72319000e-01, 6.46639452e-01, 4.80763414e-01],
       [4.15962851e-03, 1.74511389e-01, 5.03708962e-01, 4.60213118e-01],
       [3.04989943e-02, 8.57187176e-01, 2.34420788e-01, 4.11234112e-01]])

In [25]:
df1.T

,0,1,2,3,4,5,6,7,8,9
0,234.000000,0.575217,0.570574,0.875290,0.799680,0.522116,0.117037,0.737322,0.004160,0.030499
1,0.942188,0.102660,0.582973,0.709307,0.416390,0.511947,0.848875,0.472319,0.174511,0.857187
2,0.453771,0.239723,0.911643,0.726065,0.776483,0.435796,0.146866,0.646639,0.503709,0.234421
3,0.987583,0.677257,0.866714,0.590644,0.708007,0.334733,0.175809,0.480763,0.460213,0.411234

In [26]:
df1.loc

In [27]:
df1.loc [0,0] = 654

In [28]:
df1

            0         1         2         3
0  654.000000  0.942188  0.453771  0.987583
1    0.575217  0.102660  0.239723  0.677257
2    0.570574  0.582973  0.911643  0.866714
3    0.875290  0.709307  0.726065  0.590644
4    0.799680  0.416390  0.776483  0.708007
5    0.522116  0.511947  0.435796  0.334733
6    0.117037  0.848875  0.146866  0.175809
7    0.737322  0.472319  0.646639  0.480763
8    0.004160  0.174511  0.503709  0.460213
9    0.030499  0.857187  0.234421  0.411234

In [29]:
df1. head()

            0         1         2         3
0  654.000000  0.942188  0.453771  0.987583
1    0.575217  0.102660  0.239723  0.677257
2    0.570574  0.582973  0.911643  0.866714
3    0.875290  0.709307  0.726065  0.590644
4    0.799680  0.416390  0.776483  0.708007

In [30]:
df1.columns = list("abcd")
df1.head()

            a         b         c         d
0  654.000000  0.942188  0.453771  0.987583
1    0.575217  0.102660  0.239723  0.677257
2    0.570574  0.582973  0.911643  0.866714
3    0.875290  0.709307  0.726065  0.590644
4    0.799680  0.416390  0.776483  0.708007

In [31]:
df1.loc[[3,4],['c','d']]

          c         d
3  0.726065  0.590644
4  0.776483  0.708007

In [32]:
df1.loc[(df1['a']<0.3)]

          a         b         c         d
6  0.117037  0.848875  0.146866  0.175809
8  0.004160  0.174511  0.503709  0.460213
9  0.030499  0.857187  0.234421  0.411234

In [33]:
df1.drop([0,1,2])

          a         b         c         d
3  0.875290  0.709307  0.726065  0.590644
4  0.799680  0.416390  0.776483  0.708007
5  0.522116  0.511947  0.435796  0.334733
6  0.117037  0.848875  0.146866  0.175809
7  0.737322  0.472319  0.646639  0.480763
8  0.004160  0.174511  0.503709  0.460213
9  0.030499  0.857187  0.234421  0.411234

In [34]:
df1

            a         b         c         d
0  654.000000  0.942188  0.453771  0.987583
1    0.575217  0.102660  0.239723  0.677257
2    0.570574  0.582973  0.911643  0.866714
3    0.875290  0.709307  0.726065  0.590644
4    0.799680  0.416390  0.776483  0.708007
5    0.522116  0.511947  0.435796  0.334733
6    0.117037  0.848875  0.146866  0.175809
7    0.737322  0.472319  0.646639  0.480763
8    0.004160  0.174511  0.503709  0.460213
9    0.030499  0.857187  0.234421  0.411234

In [35]:
df1.drop(['a','b','c'],axis=1, inplace = False)

          d
0  0.987583
1  0.677257
2  0.866714
3  0.590644
4  0.708007
5  0.334733
6  0.175809
7  0.480763
8  0.460213
9  0.411234

In [36]:
df1.drop (['a','b','c'], axis = 1 , inplace = True)

In [37]:
df2 = pd.read_excel("C:/Users/amanp/Downloads/Fruit_Sales_Shops_New.xlsx")

In [38]:
df2.head(3)

,Shop Name,Apples,Bananas,Oranges,Mangoes,Grapes,Total Sales,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11
0,Shop_1,60,366,425,106,434,1391,NaN,NaN,fruit,shop,quant
1,Shop_2,440,180,438,93,247,1398,NaN,NaN,Shop_5,2421,NaN
2,Shop_3,177,284,516,317,258,1552,NaN,NaN,NaN,NaN,NaN

In [39]:
df2.drop(['Unnamed: 8','Unnamed: 9','Unnamed: 10','Unnamed: 11'], axis = 1 ,inplace = True)

In [40]:
df2

,Shop Name,Apples,Bananas,Oranges,Mangoes,Grapes,Total Sales,Unnamed: 7
0,Shop_1,60,366,425,106,434,1391,NaN
1,Shop_2,440,180,438,93,247,1398,NaN
2,Shop_3,177,284,516,317,258,1552,NaN
3,Shop_4,420,80,137,143,419,1199,NaN
4,Shop_5,141,141,69,573,371,1295,NaN
5,Shop_6,306,483,219,513,345,1866,NaN
6,Shop_7,349,400,587,205,168,1709,NaN
7,Shop_8,183,130,416,367,167,1263,NaN
8,Shop_9,323,326,198,521,157,1525,NaN
9,Shop_10,554,390,255,285,152,1636,NaN
10,Shop_11,334,357,575,360,235,1861,NaN
11,Shop_12,334,410,553,123,140,1560,NaN
12,Shop_13,430,509,428,152,313,1832,NaN
13,Shop_14,69,549,393,172,562,1745,NaN
14,Shop_15,278,160,285,404,310,1437,NaN
15,Shop_16,262,136,475,93,168,1134,NaN
16,Shop_17,568,146,311,173,279,1477,NaN
17,Shop_18,364,249,304,139,459,1515,NaN
18,Shop_19,516,491,579,478,92,2156,NaN
19,Shop_20,222,562,476,584,577,2421,NaN

In [41]:
import numpy as np
import pandas as pd

In [42]:
sict = {
    "name":["aman","rohan","harryy","raj"],
    "marks":[92,34,24,17],
    "city":["hisua","bareily","nawada","london"]}
print(sict)

{'name': ['aman', 'rohan', 'harryy', 'raj'], 'marks': [92, 34, 24, 17], 'city': ['hisua', 'bareily', 'nawada', 'london']}

In [43]:
df = pd.DataFrame(sict)

In [44]:
ram = df.to_csv ("DIVR.csv")

In [45]:
book = {
    "subject" : ["amths","Science"],
    "class" : [8,9]}

In [46]:
ram1 = pd.DataFrame(book)

In [47]:
ram1

   subject  class
0    amths      8
1  Science      9

In [48]:
ram2 = ram1.to_csv("shdb.csv")

In [49]:
np.identity(4)

array([[1., 0., 0., 0.],
       [0., 1., 0., 0.],
       [0., 0., 1., 0.],
       [0., 0., 0., 1.]])

In [50]:
df7 = pd.DataFrame(np.random.rand(4,5), index = np.arange(4))

In [51]:
df7

          0         1         2         3         4
0  0.812808  0.005929  0.597135  0.106288  0.876598
1  0.718152  0.435846  0.845139  0.265849  0.659475
2  0.279609  0.873053  0.725693  0.817529  0.165333
3  0.129511  0.280225  0.055893  0.204735  0.295896

In [52]:
df7.columns = list("abcde")

In [53]:
df7

          a         b         c         d         e
0  0.812808  0.005929  0.597135  0.106288  0.876598
1  0.718152  0.435846  0.845139  0.265849  0.659475
2  0.279609  0.873053  0.725693  0.817529  0.165333
3  0.129511  0.280225  0.055893  0.204735  0.295896

In [54]:
df7.loc [0] [0] = 234
df7

C:\Users\amanp\AppData\Local\Temp\ipykernel_92612\3331999626.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df7.loc [0] [0] = 234
C:\Users\amanp\AppData\Local\Temp\ipykernel_92612\3331999626.py:1: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  df7.loc [0] [0] = 234

            a         b         c         d         e
0  234.000000  0.005929  0.597135  0.106288  0.876598
1    0.718152  0.435846  0.845139  0.265849  0.659475
2    0.279609  0.873053  0.725693  0.817529  0.165333
3    0.129511  0.280225  0.055893  0.204735  0.295896

In [55]:
df7.to_numpy

<bound method DataFrame.to_numpy of             a         b         c         d         e
0  234.000000  0.005929  0.597135  0.106288  0.876598
1    0.718152  0.435846  0.845139  0.265849  0.659475
2    0.279609  0.873053  0.725693  0.817529  0.165333
3    0.129511  0.280225  0.055893  0.204735  0.295896>

In [56]:
df7.drop(['a','b'], axis = 1 , inplace =True)
df7

          c         d         e
0  0.597135  0.106288  0.876598
1  0.845139  0.265849  0.659475
2  0.725693  0.817529  0.165333
3  0.055893  0.204735  0.295896

In [57]:
df7.drop([0,1])

          c         d         e
2  0.725693  0.817529  0.165333
3  0.055893  0.204735  0.295896

In [58]:
df7

          c         d         e
0  0.597135  0.106288  0.876598
1  0.845139  0.265849  0.659475
2  0.725693  0.817529  0.165333
3  0.055893  0.204735  0.295896

In [59]:
df8 = pd.DataFrame(np.random.rand(4,6), index = np.arange(4))

In [60]:
df8

          0         1         2         3         4         5
0  0.386916  0.901139  0.689932  0.704373  0.616586  0.812935
1  0.198840  0.071192  0.909556  0.677785  0.627043  0.723153
2  0.311166  0.645501  0.467750  0.807605  0.132011  0.948964
3  0.885139  0.276810  0.425945  0.475572  0.501187  0.321622

In [61]:
df8.head(2)

          0         1         2         3         4         5
0  0.386916  0.901139  0.689932  0.704373  0.616586  0.812935
1  0.198840  0.071192  0.909556  0.677785  0.627043  0.723153

In [62]:
df8.to_numpy()

array([[0.38691613, 0.90113854, 0.68993171, 0.70437257, 0.61658639,
        0.81293549],
       [0.19883989, 0.07119172, 0.90955642, 0.67778546, 0.62704278,
        0.72315255],
       [0.31116581, 0.64550117, 0.46775006, 0.80760548, 0.13201141,
        0.94896394],
       [0.88513888, 0.2768097 , 0.42594548, 0.47557204, 0.5011867 ,
        0.32162153]])

In [63]:
df8.loc[2,4] = 234

In [64]:
df8

          0         1         2         3           4         5
0  0.386916  0.901139  0.689932  0.704373    0.616586  0.812935
1  0.198840  0.071192  0.909556  0.677785    0.627043  0.723153
2  0.311166  0.645501  0.467750  0.807605  234.000000  0.948964
3  0.885139  0.276810  0.425945  0.475572    0.501187  0.321622

In [65]:
df8.columns = list("abcdef")

In [66]:
df8

          a         b         c         d           e         f
0  0.386916  0.901139  0.689932  0.704373    0.616586  0.812935
1  0.198840  0.071192  0.909556  0.677785    0.627043  0.723153
2  0.311166  0.645501  0.467750  0.807605  234.000000  0.948964
3  0.885139  0.276810  0.425945  0.475572    0.501187  0.321622

In [67]:
df8.drop(1)

          a         b         c         d           e         f
0  0.386916  0.901139  0.689932  0.704373    0.616586  0.812935
2  0.311166  0.645501  0.467750  0.807605  234.000000  0.948964
3  0.885139  0.276810  0.425945  0.475572    0.501187  0.321622

In [68]:
list3 = [1,2,3,4]

In [72]:
df8 = pd.Series(list3)

In [73]:
list = [5,6,7,8]

In [74]:
df9 = pd.Series(list)

In [83]:
mydict = {"roll no" : list3, "payment" : list}

In [85]:
df10  = pd.DataFrame(mydict , index = np.arange(4))

In [86]:
print(df10)

   roll no  payment
0        1        5
1        2        6
2        3        7
3        4        8